; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_11_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 - counter
	)
  (:init
		(= (value c0) 6)
	(= (value c1) 98)
	(= (value c2) 64)
	(= (value c3) 46)
	(= (value c4) 78)
	(= (value c5) 95)
	(= (value c6) 5)
	(= (value c7) 39)
	(= (value c8) 32)
	(= (value c9) 52)
	(= (value c10) 31)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
		)
	)
)

; plan
1. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 5 of 10
2. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 5 of 10
3. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 5 of 10
4. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 5 of 10
5. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 5 of 10
6. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 5 of 10
7. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 5 of 10
8. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 5 of 10
9. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 5 of 10
10. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 5 of 10
11. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 5 of 10
12. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 5 of 10
13. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 5 of 10
14. (increment c10)
   changed: (value c10) from 31 to 37
   goals met: 5 of 10
15. (increase_rate c10)
   changed: (rate_value c10) from 6 to 7
   goals met: 5 of 10
16. (increment c10)
   changed: (value c10) from 37 to 44
   goals met: 5 of 10
17. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 5 of 10
18. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 5 of 10
19. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 5 of 10
20. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 5 of 10
21. (increment c8)
   changed: (value c8) from 32 to 36
   goals met: 5 of 10
22. (increment c8)
   changed: (value c8) from 36 to 40
   goals met: 6 of 10
23. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 6 of 10
24. (increment c3)
   changed: (value c3) from 46 to 51
   goals met: 6 of 10
25. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 6 of 10
26. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 6 of 10
27. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 6 of 10
28. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 6 of 10
29. (increment c3)
   changed: (value c3) from 51 to 56
   goals met: 6 of 10
30. (increment c10)
   changed: (value c10) from 44 to 51
   goals met: 6 of 10
31. (increment c10)
   changed: (value c10) from 51 to 58
   goals met: 7 of 10
32. (increment c3)
   changed: (value c3) from 56 to 61
   goals met: 7 of 10
33. (increment c3)
   changed: (value c3) from 61 to 66
   goals met: 8 of 10
34. (increase_rate c2)
   changed: (rate_value c2) from 5 to 6
   goals met: 8 of 10
35. (increase_rate c2)
   changed: (rate_value c2) from 6 to 7
   goals met: 8 of 10
36. (increment c2)
   changed: (value c2) from 64 to 71
   goals met: 7 of 10
37. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 7 of 10
38. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 7 of 10
39. (increase_rate c2)
   changed: (rate_value c2) from 7 to 8
   goals met: 7 of 10
40. (increment c2)
   changed: (value c2) from 71 to 79
   goals met: 7 of 10
41. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 7 of 10
42. (increase_rate c2)
   changed: (rate_value c2) from 8 to 9
   goals met: 7 of 10
43. (increase_rate c2)
   changed: (rate_value c2) from 9 to 10
   goals met: 7 of 10
44. (increment c3)
   changed: (value c3) from 66 to 72
   goals met: 7 of 10
45. (increment c3)
   changed: (value c3) from 72 to 78
   goals met: 6 of 10
46. (increment c2)
   changed: (value c2) from 79 to 89
   goals met: 6 of 10
47. (increment c3)
   changed: (value c3) from 78 to 84
   goals met: 6 of 10
48. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 6 of 10
49. (increment c2)
   changed: (value c2) from 89 to 99
   goals met: 7 of 10
50. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 7 of 10
51. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 7 of 10
52. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 7 of 10
53. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 7 of 10
54. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 7 of 10
55. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 7 of 10
56. (increase_rate c6)
   changed: (rate_value c6) from 6 to 7
   goals met: 7 of 10
57. (increase_rate c6)
   changed: (rate_value c6) from 7 to 8
   goals met: 7 of 10
58. (increase_rate c6)
   changed: (rate_value c6) from 8 to 9
   goals met: 7 of 10
59. (increase_rate c6)
   changed: (rate_value c6) from 9 to 10
   goals met: 7 of 10
60. (increment c6)
   changed: (value c6) from 5 to 15
   goals met: 7 of 10
61. (increment c6)
   changed: (value c6) from 15 to 25
   goals met: 7 of 10
62. (increment c6)
   changed: (value c6) from 25 to 35
   goals met: 7 of 10
63. (increment c6)
   changed: (value c6) from 35 to 45
   goals met: 6 of 10
64. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 6 of 10
65. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 6 of 10
66. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 6 of 10
67. (increment c6)
   changed: (value c6) from 45 to 55
   goals met: 6 of 10
68. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 6 of 10
69. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 6 of 10
70. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 6 of 10
71. (decrement c6)
   changed: (value c6) from 55 to 45
   goals met: 6 of 10
72. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 6 of 10
73. (increment c6)
   changed: (value c6) from 45 to 55
   goals met: 6 of 10
74. (decrement c5)
   changed: (value c5) from 95 to 88
   goals met: 6 of 10
75. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 6 of 10
76. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 6 of 10
77. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 6 of 10
78. (decrement c6)
   changed: (value c6) from 55 to 45
   goals met: 6 of 10
79. (decrement c5)
   changed: (value c5) from 88 to 78
   goals met: 5 of 10
80. (decrement c4)
   changed: (value c4) from 78 to 77
   goals met: 6 of 10
81. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 6 of 10
82. (decrement c2)
   changed: (value c2) from 99 to 89
   goals met: 5 of 10
83. (decrement c2)
   changed: (value c2) from 89 to 79
   goals met: 6 of 10
84. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 6 of 10
85. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 6 of 10
86. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 6 of 10
87. (decrement c1)
   changed: (value c1) from 98 to 93
   goals met: 6 of 10
88. (decrement c1)
   changed: (value c1) from 93 to 88
   goals met: 6 of 10
89. (decrement c1)
   changed: (value c1) from 88 to 83
   goals met: 6 of 10
90. (decrement c1)
   changed: (value c1) from 83 to 78
   goals met: 7 of 10
91. (decrement c3)
   changed: (value c3) from 84 to 78
   goals met: 6 of 10
92. (decrement c3)
   changed: (value c3) from 78 to 72
   goals met: 7 of 10
93. (decrement c2)
   changed: (value c2) from 79 to 69
   goals met: 7 of 10
94. (decrement c1)
   changed: (value c1) from 78 to 73
   goals met: 7 of 10
95. (decrement c1)
   changed: (value c1) from 73 to 68
   goals met: 8 of 10
96. (increment c6)
   changed: (value c6) from 45 to 55
   goals met: 8 of 10
97. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 8 of 10
98. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 8 of 10
99. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 8 of 10
100. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 8 of 10
101. (increment c7)
   changed: (value c7) from 39 to 43
   goals met: 7 of 10
102. (increment c8)
   changed: (value c8) from 40 to 44
   goals met: 8 of 10
103. (increment c7)
   changed: (value c7) from 43 to 47
   goals met: 7 of 10
104. (increment c8)
   changed: (value c8) from 44 to 48
   goals met: 8 of 10
105. (decrement c6)
   changed: (value c6) from 55 to 45
   goals met: 9 of 10
106. (decrement c5)
   changed: (value c5) from 78 to 68
   goals met: 8 of 10
107. (decrement c5)
   changed: (value c5) from 68 to 58
   goals met: 8 of 10
108. (decrement c5)
   changed: (value c5) from 58 to 48
   goals met: 8 of 10
109. (decrement c5)
   changed: (value c5) from 48 to 38
   goals met: 9 of 10
110. (decrement_rate c5)
   changed: (rate_value c5) from 10 to 9
   goals met: 9 of 10
111. (decrement_rate c4)
   changed: (rate_value c4) from 2 to 1
   goals met: 9 of 10
112. (increment c5)
   changed: (value c5) from 38 to 47
   goals met: 8 of 10
113. (decrement c4)
   changed: (value c4) from 77 to 76
   goals met: 8 of 10
114. (decrement c4)
   changed: (value c4) from 76 to 75
   goals met: 8 of 10
115. (decrement c4)
   changed: (value c4) from 75 to 74
   goals met: 8 of 10
116. (decrement c4)
   changed: (value c4) from 74 to 73
   goals met: 8 of 10
117. (decrement_rate c4)
   changed: (rate_value c4) from 1 to 0
   goals met: 8 of 10
118. (increment c5)
   changed: (value c5) from 47 to 56
   goals met: 8 of 10
119. (increment c5)
   changed: (value c5) from 56 to 65
   goals met: 8 of 10
120. (increment c5)
   changed: (value c5) from 65 to 74
   goals met: 9 of 10
121. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 9 of 10
122. (decrement c5)
   changed: (value c5) from 74 to 64
   goals met: 8 of 10
123. (increment c6)
   changed: (value c6) from 45 to 55
   goals met: 7 of 10
124. (increment c7)
   changed: (value c7) from 47 to 51
   goals met: 6 of 10
125. (increment c8)
   changed: (value c8) from 48 to 52
   goals met: 6 of 10
126. (increment c7)
   changed: (value c7) from 51 to 55
   goals met: 5 of 10
127. (increment c8)
   changed: (value c8) from 52 to 56
   goals met: 6 of 10
128. (increment c7)
   changed: (value c7) from 55 to 59
   goals met: 6 of 10
129. (increment c8)
   changed: (value c8) from 56 to 60
   goals met: 7 of 10
130. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 7 of 10
131. (increment c9)
   changed: (value c9) from 52 to 55
   goals met: 7 of 10
132. (increment c9)
   changed: (value c9) from 55 to 58
   goals met: 6 of 10
133. (increment c10)
   changed: (value c10) from 58 to 65
   goals met: 7 of 10
134. (increment c9)
   changed: (value c9) from 58 to 61
   goals met: 8 of 10
135. (increment c5)
   changed: (value c5) from 64 to 74
   goals met: 9 of 10
136. (increment c6)
   changed: (value c6) from 55 to 65
   goals met: 8 of 10
137. (increment c7)
   changed: (value c7) from 59 to 63
   goals met: 7 of 10
138. (increment c8)
   changed: (value c8) from 60 to 64
   goals met: 7 of 10
139. (increment c9)
   changed: (value c9) from 61 to 64
   goals met: 7 of 10
140. (increment c9)
   changed: (value c9) from 64 to 67
   goals met: 7 of 10
141. (increment c10)
   changed: (value c10) from 65 to 72
   goals met: 8 of 10
142. (increment c7)
   changed: (value c7) from 63 to 67
   goals met: 8 of 10
143. (increment c8)
   changed: (value c8) from 64 to 68
   goals met: 8 of 10
144. (increment c9)
   changed: (value c9) from 67 to 70
   goals met: 9 of 10
145. (increment c6)
   changed: (value c6) from 65 to 75
   goals met: 9 of 10
146. (increment c7)
   changed: (value c7) from 67 to 71
   goals met: 8 of 10
147. (increment c8)
   changed: (value c8) from 68 to 72
   goals met: 8 of 10
148. (increment c9)
   changed: (value c9) from 70 to 73
   goals met: 8 of 10
149. (increment c10)
   changed: (value c10) from 72 to 79
   goals met: 9 of 10
150. (increment c7)
   changed: (value c7) from 71 to 75
   goals met: 8 of 10
151. (increment c8)
   changed: (value c8) from 72 to 76
   goals met: 8 of 10
152. (increment c9)
   changed: (value c9) from 73 to 76
   goals met: 8 of 10
153. (increment c9)
   changed: (value c9) from 76 to 79
   goals met: 8 of 10
154. (increment c10)
   changed: (value c10) from 79 to 86
   goals met: 9 of 10
155. (increment c7)
   changed: (value c7) from 75 to 79
   goals met: 9 of 10
156. (increment c8)
   changed: (value c8) from 76 to 80
   goals met: 9 of 10
157. (increment c9)
   changed: (value c9) from 79 to 82
   goals met: 10 of 10
